app/controllers/admin/hotels_controller.rb

  def index
    @hotels = Hotel.order(created_at: :desc).page(params[:page])
---
SELECT  "hotels".* FROM "hotels" ORDER BY "hotels"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]

  def show
    @hotel = Hotel.find(params[:id])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @hotel = Hotel.find(params[:id])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @hotel.update(hotel_params)
---
UPDATE "hotels" SET "updated_at" = ?, "aasm_state" = ? WHERE "hotels"."id" = ?  [["updated_at", "2017-07-13 14:26:54.947518"], ["aasm_state", "pending"], ["id", 1]]

    def set_hotel
      @hotel = Hotel.find(params[:id])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]