app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @admin_users = User.all

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?)
---
  def create
    @admin_user = User.new(admin_user_params)

    respond_to do |format|
      if @admin_user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @admin_user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_admin_user
      @admin_user = User.find(params[:id])