app/controllers/hotels_controller.rb

SELECT  "hotels".* FROM "hotels" WHERE "hotels"."status" = ? ORDER BY "hotels"."created_at" DESC LIMIT ? OFFSET ?  [["status", "approved"], ["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    @hotels = Hotel.where(status: "approved").order(created_at: :desc).page(params[:page])

SELECT  "hotels".* FROM "hotels" WHERE "hotels"."status" = ? ORDER BY "hotels"."rate" DESC LIMIT ?  [["status", "approved"], ["LIMIT", 5]]
---
  def top
    @hotels = Hotel.where(status: "approved").order(rate: :desc).limit(5);