app/controllers/hotels_controller.rb

  def index
    @hotels = Hotel.where(aasm_state: "approved").order(created_at: :desc).page(params[:page])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."aasm_state" = ? ORDER BY "hotels"."created_at" DESC LIMIT ? OFFSET ?  [["aasm_state", "approved"], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "hotels" WHERE "hotels"."aasm_state" = ?  [["aasm_state", "approved"]]

  def top
    @hotels = Hotel.where(aasm_state: "approved").order(rate: :desc).limit(5);
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."aasm_state" = ? ORDER BY "hotels"."rate" DESC LIMIT ?  [["aasm_state", "approved"], ["LIMIT", 5]]

  def show
    @hotel = Hotel.find(params[:id])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @hotel = Hotel.new(hotel_params)
    @hotel.rate=0;
    @hotel.user_id = current_user.id
    respond_to do |format|
      if @hotel.save
---
INSERT INTO "hotels" ("name", "star", "breakfest", "address", "created_at", "updated_at", "description", "user_id", "room", "price", "rate", "aasm_state") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @hotel.destroy
---
DELETE FROM "hotels" WHERE "hotels"."id" = ?  [["id", 1]]

  def approve
    @hotel = Hotel.find(params[:hotel_id])
    @hotel.approve
    @hotel.save
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "hotels" SET "updated_at" = ?, "aasm_state" = ? WHERE "hotels"."id" = ?  [["updated_at", "2017-07-13 14:21:28.664330"], ["aasm_state", "approved"], ["id", 1]]

  def reject
    @hotel = Hotel.find(params[:hotel_id])
    @hotel.reject
    @hotel.save
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "hotels" SET "updated_at" = ?, "aasm_state" = ? WHERE "hotels"."id" = ?  [["updated_at", "2017-07-13 14:21:41.859292"], ["aasm_state", "rejected"], ["id", 2]]

  def set_hotel
    @hotel = Hotel.find(params[:id])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]