app/controllers/reviews_controller.rb

SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("rate", "review", "created_at", "updated_at", "user_id", "hotel_id") VALUES (?, ?, ?, ?, ?, ?)  [["rate", 3], ["review", "aaa"], ["created_at", "2017-07-10 15:47:10.627589"], ["updated_at", "2017-07-10 15:47:10.627589"], ["user_id", 4], ["hotel_id", 2]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."hotel_id" = ?  [["hotel_id", 2]]
UPDATE "hotels" SET "updated_at" = ?, "rate" = ? WHERE "hotels"."id" = ?  [["updated_at", "2017-07-14 12:46:21.934953"], ["rate", 4], ["id", 1]]
---
  def create
    @hotel = Hotel.find(params[:hotel_id])
    @review=@hotel.reviews.build(review_params)
    @review.user_id = current_user.id
    respond_to do |format|
      if @review.save
        @hotel.rate=@hotel.reviews.sum{|review| review.rate}/@hotel.reviews.count
        @hotel.save

SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."hotel_id" = ? AND "reviews"."id" = ? LIMIT ?  [["hotel_id", 4], ["id", 3], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 3]]
---
  def destroy
    @hotel = Hotel.find(params[:hotel_id])
    @review = @hotel.reviews.find(params[:id])
    @review.destroy