app/views/hotels/show.html.haml

    %h3 Отзывы
  -if user_signed_in? && @hotel.reviews.where(user_id: current_user.id).empty?
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."hotel_id" = ?  [["hotel_id", 1]]